# ShowSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDuctFittingAndAccessoryPressureDropUIServer..::..ShowSettings Method
IDuctFittingAndAccessoryPressureDropUIServer Interface See Also
---
Shows the settings UI.
**Namespace:** Autodesk.Revit.UI.Mechanical**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
bool ShowSettings(
	DuctFittingAndAccessoryPressureDropUIData data
)
```

Visual Basic
---
```text
Function ShowSettings ( _
	data As DuctFittingAndAccessoryPressureDropUIData _
) As Boolean
```

Visual C++
---
```text
bool ShowSettings(
	DuctFittingAndAccessoryPressureDropUIData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.UI.Mechanical..::..DuctFittingAndAccessoryPressureDropUIData The input data of the calculation.
# ### Return Value
True if the user makes any changes in the UI, false otherwise.
# See Also
IDuctFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Mechanical Namespace